      *> ***************************************************************
      *> (C) COPYRIGHT Baig Software 2024. ALL RIGHTS RESERVED
      *> ***************************************************************
      *> PROGRAM:  HelloWorld
      *>
      *> AUTHOR :  Saadat Baig
      *>
      *> THE VERY FIRST STEPS INTO COBOL
      *> ****************************************************************
        IDENTIFICATION DIVISION.
        PROGRAM-ID. HelloWorld.
        PROCEDURE DIVISION.
            DISPLAY 'Hello, World!'.
            STOP RUN.
